{"meta":{"title":"Hexo","subtitle":"","description":"","author":"John Doe","url":"http://example.com","root":"/"},"pages":[{"title":"About","date":"2021-12-23T06:41:01.309Z","updated":"2021-12-23T06:41:01.296Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"Hi there 👋 I’m a current MS student in the CS field. Welcome to my place! About me: 🌱 Passionate about learning new skills 👩🏻‍💻 Previously worked as a Software Development Intern 🧐 Incoming 2022 Summer SDE Intern"},{"title":"Links","date":"2021-07-12T10:08:51.136Z","updated":"2021-07-12T10:05:08.188Z","comments":true,"path":"links/index.html","permalink":"http://example.com/links/index.html","excerpt":"","text":""},{"title":"Categories","date":"2021-07-12T10:08:51.114Z","updated":"2021-07-12T10:04:57.753Z","comments":false,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2021-07-12T10:08:51.190Z","updated":"2021-07-12T10:05:24.084Z","comments":false,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""},{"title":"Repositories","date":"2021-07-28T07:32:23.589Z","updated":"2021-07-12T09:11:52.305Z","comments":false,"path":"repository/index.html","permalink":"http://example.com/repository/index.html","excerpt":"","text":""}],"posts":[{"title":"What did I do as an SDE intern at IKEA?","slug":"What-did-I-do-as-an-SDE-intern-at-IKEA","date":"2021-09-05T19:41:31.000Z","updated":"2021-12-23T06:29:40.502Z","comments":true,"path":"2021/09/05/What-did-I-do-as-an-SDE-intern-at-IKEA/","link":"","permalink":"http://example.com/2021/09/05/What-did-I-do-as-an-SDE-intern-at-IKEA/","excerpt":"","text":"In the last year, I worked as a full-time Software Engineer Intern at IKEA. My job was mainly delivering frontends for the IKEA WeChat SMP. I also contributed to the static webpage library for the APP/SMP team. Project overviewThe project I mainly worked on during my internship is called IKEA WeChat SMP. I created reusable components like address selector, broadcast popups, configurable floating buttons, advertise card, etc. and I also designed and implemented product inventory module, optimized logic for delivery, live stream, checkout and coupons. Check out this video recorded when I use the IKEA WeChat SMP: If you are a WeChat user, you can search for this program in WeChat. What we built is basically the online shopping center of IKEA integrated in WeChat, which is the most widely used (1.25 billion monthly active users) social app in China. I was lucky enough to participate in the initial building work and witness the official nationwide launch of this project. This project achieved 6x,xxx average daily active users with 6xx.xK RMB average sales per day after the official launch. A day in my life at IKEAMy work time is usually from 9:30 a.m. to 6:00 p.m., Monday to Friday. Morning routine: Stand-up meetingEvery morning when I arrive at our office building, our team will have a daily stand-up meeting to talk about our progress and check the obstacles in our work. It is usually about 10 minutes, and it marks the start of my day at work. This is also my best chance to know about what other people in my team are working on. Gradually, I gained a more comprehensive understanding of the projects’ status in my team as well. Sprint start: getting my tasks on JIRASince I worked in a Scrum team, we have sprints. A sprint is like an iteration period. A normal sprint is 2 weeks usually. When the sprint starts, we will have an Iteration (or Sprint) Planning Meeting (IPM). In this meeting, we will discuss how much of the backlog can be committed to and delivered in this sprint. The tasks will be evaluated in story points. After the sprint starts, I will have several tasks on JIRA which show the work I need to get done in this sprint. I am also responsible to update my task status every day. Sprint ongoing: develop, discuss, and deliverDuring the sprint, I would discuss some ambiguous points with the Product Owner, and code to meet up the expectations. This process also includes a lot of conversations with the UI/UX designer, the Quality Assurance Engineer, the Backend Development Engineer, and even people from other teams or departments. It was a big step for me to gather the courage to start conversations with so many people. Don’t laugh. I was super shy and for a long time, it was really hard for me to speak up to any person. It is because of how nice the people here are that makes me comfortable to express my opinion and become more and more confident. When I think my code is ready, I would inform a QA Engineer to put my code into testing. When the testings are passed, and the PO thinks it fulfills the acceptance criteria, my code will go online to our shopping program for people to use. Snacks are amazing!!Yes, I gained weight here. 🥲 Here we have different kinds of snacks and fruit every day. I love the cheesecakes - I know it’s not that healthy - which are so beautiful and delicious. The kiwis here are always sweeter than the ones I brought from the market. And when there’s an activity or party, we have more. There are yogurt, bread, chocolate cake, fried chicken, meatballs, sausages, cookies, sushis, more than ten kinds of drinks… Summary2020 is definitely a special year for many people. For me as well. Instead of pursuing my graduate study right after finishing my undergrad study as I originally planned, I was “forced” by COVID-19 to take a gap year and did my first formal internship in life. I was lucky enough to spend this year with people at IKEA. I want to thank everyone in my team, who was the kindest person and most willing to answer my questions at any time. I also want to especially thank my line manager Leo and my mentor, Ciki, who perfected my internship. When I first arrived at IKEA, I almost knew nothing about real-industry software development and I was even not very familiar with Git then (Yeah that’s true). Ciki is always happy to give me useful instructions and show me the right direction to work in. It was a great time working here, and the people here are so welcoming and so supportive to me. See you, IKEA!","categories":[],"tags":[]},{"title":"Quick Notes on Scrum Basics","slug":"Quick-Notes-on-Scrum-Basics","date":"2021-07-30T01:52:38.000Z","updated":"2021-07-29T13:58:34.164Z","comments":true,"path":"2021/07/29/Quick-Notes-on-Scrum-Basics/","link":"","permalink":"http://example.com/2021/07/29/Quick-Notes-on-Scrum-Basics/","excerpt":"","text":"Quick notes of the Linkedin Learning Course “Scrum: The Basics” by Kelley O’Connell, with my own experience in the workspace. Problems to SolveWhat does the Team’s BACKLOG contain?A: a prioritized list of work that must be done Select something Scrum Teams do at the end of every sprint.A: Demonstrate the completed work. In the Agile Manifesto, Scrum values _.A: responding to change The Heart of the FrameworkAgile Project: Product Owner Scrum Master What are the 3 normal project constraints?time, cost, scope What are two key Scrum roles?Product Owner and Scrum Master What do you use to establish ground rules with the Team?Team Norms Getting Ready to WorkMinimun Viable Product (MVP) User Stories As a , I want so that . Acceptance Criteria (AC) Iteration (or Sprint) Planning Meetings (IPM) What do Scrum Teams use to break their work into small, deliverable elements?User Stories The Roadmap is meant to apply your work Themes over time.TRUE What types of estimation do Scrum Teams use to size their stories?Actual Estimation &amp; Relative Estimation Getting Down to WorkWhat do Scrum Teams use to visually represent their project?Information radiators The Scrum Team must always work their stories in priority order.FALSE The PO can add a new story to a Sprint that the Team is currently in.FALSE All of the following are TRUE about the Daily Scrum except _. everyone stands up ✓ it lasts 15 minnutes ✓ everyone answers the same 3 questions ✓ it lasts 30 minutes ✗ Wrapping Up a SprintRetrospective The Team demonstrates the work they haven’t tested yet.FALSE This key Scrum role is the only one that can accept a story as done.Product Owner Why do Scrum Teams hold Retrospectives after every sprint?to recognize how they can improve their work practices","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2021-07-12T09:00:22.219Z","updated":"2021-12-23T05:30:44.065Z","comments":true,"path":"2021/07/12/hello-world/","link":"","permalink":"http://example.com/2021/07/12/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Generate static files1$ hexo generate or: 1$ hexo g More info: Generating Run server1$ hexo server or: 1$ hexo s More info: Server Deploy to remote sites1$ hexo deploy or: 1$ hexo d More info: Deployment Usual Practice1234$ hexo clean$ hexo g$ hexo s$ hexo d Note: hexo clean does not have a short form.","categories":[],"tags":[]}],"categories":[],"tags":[]}